Revit 2027 API
MEPAnalyticalSegment.DomainType Property
 The connector domain type of this segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorDomainType DomainType { get; }
Public ReadOnly Property DomainType As ConnectorDomainType
	Get
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
}
member DomainType : ConnectorDomainType with get
Property Value
ConnectorDomainType
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace